{
    "category": "hadith",
    "en": {
        "title": "HADITH 19 : Allah's Protection",
        "text": "On the authority of Abdullah bin Abbas, who said : One day I was behind the prophet and he said to me: 'Young man, I shall teach you some words [of advice] : Be mindful of Allah, and Allah will protect you. Be mindful of Allah, and you will find Him in front of you. If you ask, ask of Allah; if you seek help, seek help of Allah. Know that if the Nation were to gather together to benefit you with anything, it would benefit you only with something that Allah had already prescribed for you, and that if they gather together to harm you with anything, they would harm you only with something Allah had already prescribed for you. The pens have been lifted and the pages have dried.'narrated by Termithi, who said it is true and fine hadithIn a version other than that of Tirmithi it reads:'..Be mindful of Allah, you will find Him before you. Get to know Allah in prosperity and He will know you in adversity. Know that what has passed you by was not going to befall you; and that what has befallen you was not going to pass you by. And know that victory comes with patience, relief with affliction, and ease with hardship.'",
        "video": [
            {
                "sheikh": "Sheikh Uthman Ibn Farooq",
                "video": "https://www.youtube.com/embed/MktuyXYwRGs?start=1457"
            }
        ]
    },
    "ar": {
        "title": "الحديث التاسع عشر: الإيمان بالقضاء والقدر",
        "text": "عَن أَبِي العبَّاسِ عبْدِ الله بنِ عَبّاسٍ رَضِي اللهُ عَنْهُما قالَ كُنْتُ خَلْفَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا، فَقَالَ: { يَا غُلاَمُ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ؛ احْفَظِ اللهَ يَحْفَظْكَ، احْفَظِ اللهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلِ اللهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللهِ، وَاعْلَمْ أَنَّ الأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلاَّ بِشَيْءٍ قَدْ كَتَبَهُ اللهُ لَكَ، وَإِنِ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلاَّ بِشَيْءٍ قَدْ كَتَبَهُ اللهُ عَلَيْكَ، رُفِعَتِ الأَقْلاَمُ وَجَفَّتِ الصُّحُفُ}. رواه التِّرمذيُّ، وقالَ:حديثٌ حَسَنٌ صحيحٌ.وفي روايةِ غيرِ التِّرمذيِّ.: { احْفَظِ اللهَ تَجِدْهُ أَمَامَكَ، تَعَرَّفْ إِلَى اللهِ فِي الرَّخَاءِ يَعْرِفْكَ فِي الشِّدَّةِ، وَاعْلَمْ أَنَّ مَا أَخْطَأكَ لَمْ يَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ، وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنَّ الْفَرَجَ مَعَ الْكَرْبِ، وَأَنَّ مَعَ الْعُسْرِ يُسْرًا}.",
        "video": [
            {
                "sheikh": "الشيخ عثمان الخميس",
                "video": "https://www.youtube.com/embed/h03n3KSLTHY"
            }
        ]
    },
    "no": 19
}