{
    "category": "hadith",
    "en": {
        "title": "Hadith 2: Islam, faith, and excellence",
        "text": "Also on the authority of Omar, who said : One day while we were sitting with the messenger of Allah there appeared before us a man whose clothes were exceedingly white and whose hair was exceedingly black; no signs of journeying were to be seen on him and none of us knew him. He walked up and sat down by the prophet. Resting his knees against his and placing the palms of his hands on his thighs, he said:'O Muhammed, tell me about Islam'. The messenger of Allah said: 'Islam is to testify that there is no god but Allah and Muhammed is the messenger of Allah, to perform the prayers, to pay the zakat, to fast in Ramadhan, and to make the pilgrimage to the House if you are able to do so.' He said:'You have spoken rightly', and we were amazed at him asking him and saying that he had spoken rightly. He said: 'Then tell me about eman .'He said:'It is to believe in Allah, His angels, His books, His messengers, and the Last Day, and to believe in divine destiny, both the good and the evil thereof.' He said:'You have spoken rightly'. He said: ' Then tell me about ehsan .' He said: 'It is to worship Allah as though you are seeing Him, and while you see Him not yet truly He sees you'. He said: 'Then tell me about the Hour'. He said: 'The one questioned about it knows no better than the questioner.' He said: 'Then tell me about its signs.' He said: 'That the slave-girl will give birth to her mistress and that you will see the barefooted, naked, destitute herdsman competing in constructing lofty buildings.' Then he took himself off and I stayed for a time. Then he said: 'O Omar, do you know who the questioner was?' I said: 'Allah and His messenger know best'. He said: 'He was Jebreel (Gabriel), who came to you to teach you your religion.'narrated by Muslim",
        "video": [
            {
                "sheikh": "Sheikh Uthman Ibn Farooq",
                "video": "https://www.youtube.com/embed/Wjkp0_Ux2mE"
            },
            {
                "sheikh": "Sheikh Uthman Ibn Farooq",
                "video": "https://www.youtube.com/embed/haoAnkGy3Po"
            }
        ]
    },
    "ar": {
        "title": "الحديث الثاني: الإسلام والإيمان والإحسان",
        "text": "عن عُمرَ رَضِي اللهُ عَنْهُ قالَ:( بَينَما نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذاتَ يَوْمٍ إذْ طلَعَ عَلَيْنا رَجُلٌ شَديدُ بَيَاضِ الثِّيابِ، شَديدُ سَوادِ الشَّعْرِ، لا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلا يَعْرِفُهُ مِنَّا أَحَدٌ، حتَّى جَلَسَ إلى النَّبيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَأَسْنَدَ رُكْبَتَيْهِ إِلى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ على فَخِذَيْهِ؛ قالَ: يا محمَّدُ، أَخْبِرْنِي عَنِ الإسْلامِ. فَقالَ رسولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: {الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَتُقِيمَ الصَّلاَةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِليْهِ سَبِيلاً}.        قالَ: صَدَقْتَ. قالَ: فَعَجِبْنا لَهُ، يَسْأَلُهُ وَيُصَدِّقُهُ. قالَ: فَأَخْبِرْنِي عَنِ الإيمانِ. قالَ: {أَنْ تُؤْمِنَ بِاللهِ وَمَلاَئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَاليَوْمِ الآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِِ}.        قالَ: صَدَقْتَ. قالَ: فَأَخْبِرْني عَنِ الإحسانِ؟        قالَ: {أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فإِنَّهُ يَرَاكَ}.        قالَ: فَأَخْبِرْني عَنِ السَّاعةِ. قالَ: {مَا الْمَسْؤُولُ عَنْها بِأَعْلَمَ مِنَ السَّائِلِ}.        قالَ: فَأخْبِرْني عَنْ أَمَاراتِها. قالَ: {أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ، يَتَطاوَلُونَ فِي الْبُنْيَانِ}. قالَ: ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا.ثُمَّ قالَ لي: {يا عُمَرُ، أَتَدْرِي مَنِ السَّائِلُ؟}. قُلتُ: اللهُ وَرَسُولُهُ أَعْلَمُ. قالَ: {فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ})        رواه مسلمٌ.",
        "video": [
            {
                "sheikh": "الشيخ عثمان الخميس",
                "video": "https://www.youtube.com/embed/MO6rJjcO4cY"
            }
        ]
    },
    "no": 2
}