{
    "category": "hadith",
    "en": {
        "title": "Hadith 25: Types of good deeds",
        "text": "Aba Dharr reported God’s messenger as saying,“In every ascription of glory to God, every declaration of His greatness, every utterance of praise to Him, every declaration that He is the only God, in enjoining what is reputable, in forbidding what is objectionable, and in a man’s sexual intercourse there is sadaqa.”On being asked whether a reward would be given for satisfying one’s passion, he said,“Tell me; if he were to devote it to something forbidden, would it not be a sin on his part? Similarly, if he were to devote it to something lawful, he would have a reward.”Muslim transmitted it.",
        "video": [
            {
                "sheikh": "Sheikh Uthman Ibn Farooq",
                "video": "https://www.youtube.com/embed/fuKC8DMUMTQ?start=1199"
            }
        ]
    },
    "ar": {
        "title": "الحديث الخامس والعشرون: أنواع الأعمال الخيرية",
        "text": "عن أبي ذَرٍّ رَضِي اللهُ عَنْهُ، أَنَّ نَاسًا مِنْ أَصْحابِ رسولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قالُوا لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ( يَا رَسُولَ اللهِ، ذَهَبَ أَهْلُ الدُّثُورِ بِالأُجُورِ؛ يُصَلُّونَ كَمَا نُصَلِّي، ويَصُومُونَ كَمَا نَصُومُ، ويَتَصَدَّقُونَ بِفُضُولِ أَموالِهِم. قالَ: { أَوَلَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَدَّقُونَ، إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً، وَكُلِّ تَكْبِيرَةٍ صَدَقَةً، وَكُلِّ تَحْمِيدَةٍ صَدَقَةً، وَكُلِّ تَهْلِيلَةٍ صَدَقَةً، وَأمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ، وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ، وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ}. قَالُوا: يَا رَسُولَ اللهِ، أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ أَجْرٌ؟ قالَ: { أَرَأيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلاَلِ كَانَ لَهُ أَجْرٌ}).",
        "video": [
            {
                "sheikh": "الشيخ عثمان الخميس",
                "video": "https://www.youtube.com/embed/GHf8mf3p7fw"
            }
        ]
    },
    "no": 25
}