{
    "category": "hadith",
    "en": {
        "title": "HADITH 4 : Creation of human being; Al-Qadar",
        "text": "On the authority of Abdullah bin Masud, who said : the messenger of Allah, and he is the truthful, the believed narrated to us :'Verily the creation of each one of you is brought together in his mother's belly for forty days in the form of seed, then he is a clot of blood for a like period, then a morsel of flesh for a like period, then there is sent to him the angel who blows the breath of life into him and who is commanded about four matters: to write down his means of livelihood, his life span, his actions, and whether happy or unhappy. By Allah, other than Whom there is no god, verily one of you behaves like the people of Paradise until there is but an arm's length between him and it, and that which has been written over takes him and so he behaves like the people of Hell-fire and thus he enters it; and one of you behaves like the people of Hell-fire until there is but an arm's length between him and it, and that which has been written over takes him and so he behaves like the people of Paradise and thus he enters it.'related by Bukhari and Muslim",
        "video": [
            {
                "sheikh": "Sheikh Uthman Ibn Farooq",
                "video": "https://www.youtube.com/embed/oRvXGAAVmeU"
            }
        ]
    },
    "ar": {
        "title": "الحديث الرابع: مراحل الخلق",
        "text": " عَلَيْهِ وَسَلَّمَ، وهو الصَّادِقُ المصْدُوقُ: { إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذلِكَ، ثمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ فَيَنْفُخُ فيهِ الرُّوحَ، وَيُؤمَرُ بأرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أوْ سَعِيدٌ. فَوَاللهِ الَّذِي لاَ إِلَهَ غَيْرُهُ، إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ، فَيَسْبِقَ عَلَيْهِ الْكِتَابُ، فَيَعْمَلَ بِعَمَلِ أَهْلِ النَّارِ فيَدْخُلَهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أهْلِ النَّارِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ، فيَسْبِقَ عَلَيْهِ الْكِتَابُ، فَيَعْمَلَ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلَهَا}) رواه البخاريُّ ومسلمٌ.",
        "video": [
            {
                "sheikh": "الشيخ عثمان الخميس",
                "video": "https://www.youtube.com/embed/3EuUk5iS0W8"
            }
        ]
    },
    "no": 4
}